# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
#
# Ultralytics YOLO11 object detection model
# MODIFIED with P2, P3, P4, AND P5 outputs (4 heads)
#
# This config:
#   1. ADDS a P2 detection head (for 1/4 scale, tiny objects)
#   2. KEEPS the P5 detection head (for 1/32 scale, large objects)
#
# This is a "do-it-all" model, but will be the most
# computationally expensive and slowest to train.

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11 backbone (same as before)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2  ### P2 backbone features
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4  ### P3 backbone features
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6  ### P4 backbone features
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10 ### P5 backbone features

# YOLO11-P2-P5 head (4 heads)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # 12 (cat backbone P4 - from layer 6)
  - [-1, 2, C3k2, [512, False]] # 13 (P4-head)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # 15 (cat backbone P3 - from layer 4)
  - [-1, 2, C3k2, [256, False]] # 16 (P3-head)

  ### --- ADDED P2 HEAD BLOCK --- ###
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17 (new)
  - [[-1, 2], 1, Concat, [1]] # 18 (new) - cat backbone P2 (from layer 2)
  - [-1, 2, C3k2, [128, False]] # 19 (new) (P2-head output) <-- DETECT 1 (P2)

  ### --- DOWN-SAMPLE PATH P2->P3 --- ###
  - [-1, 1, Conv, [128, 3, 2]]   # 20 (new)
  - [[-1, 16], 1, Concat, [1]]  # 21 (new) - cat P3-head (from layer 16)
  - [-1, 2, C3k2, [256, False]]  # 22 (new) (P3-detect output) <-- DETECT 2 (P3)

  ### --- DOWN-SAMPLE PATH P3->P4 --- ###
  - [-1, 1, Conv, [256, 3, 2]]   # 23 (new)
  - [[-1, 13], 1, Concat, [1]]  # 24 (new) - cat P4-head (from layer 13)
  - [-1, 2, C3k2, [512, False]]  # 25 (new) (P4-detect output) <-- DETECT 3 (P4)

  ### --- KEPT P5 BLOCK (from original model) --- ###
  - [-1, 1, Conv, [512, 3, 2]]   # 26 (re-added)
  - [[-1, 10], 1, Concat, [1]]  # 27 (re-added) - cat P5-backbone (from layer 10)
  - [-1, 2, C3k2, [1024, True]]  # 28 (re-added) (P5-detect output) <-- DETECT 4 (P5)

  ### --- MODIFIED 4-HEAD DETECT LAYER --- ###
  - [[19, 22, 25, 28], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)